<a href="https://colab.research.google.com/github/Sridharpadhy/Nt-Mine/blob/main/Untitled.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
Table – EmployeeDetails

EmpId	FullName	ManagerId	DateOfJoining	City
121	John Snow	321	01/31/2019	Toronto
321	Walter White	986	01/30/2020	California
421	Kuldeep Rana	876	27/11/2021	New Delhi

In [ ]:
Table – EmployeeSalary

EmpId	Project	Salary	Variable
121	P1	8000	500
321	P2	10000	1000
421	P1	12000	0

In [ ]:
1. Write an SQL query to fetch all the EmpIds which are present in either of the tables – ‘EmployeeDetails’ and ‘EmployeeSalary’.

select empid from employeedetails 
union
select emoid from employeesalary

In [ ]:
 2. Write an SQL query to fetch records that are present in one table but not in another table.

 select * from empldetail
 minus
 select * from emplsalary

In [ ]:
3. Write an SQL query to fetch the EmpIds that are present in EmployeeDetails but not in EmployeeSalary.

select empid from employeedetails 
where empid not in  (select empid from employeesalary )

In [ ]:
4. select replace (empname , ' ' , '-' ) from empl

In [ ]:
5. Write an SQL query to fetch the position of a given character(s) in a field.

Select INSTR( fullname , 'snow') from employeedetails

In [ ]:
6. Write an SQL query to display both the EmpId and ManagerId together.
Select concat(empid,managerid) from emplodeta

In [ ]:
7. Write a query to fetch only the first name(string before space) from the FullName column of the EmployeeDetails table.
 mid id used for fetch and locate for location 

 select mid( fullname , 1 , locate(fullname , ' ')) from empdetail

In [ ]:
8. Write an SQL query to find the count of the total occurrences of a particular character – ‘n’ in the FullName field. 
Select Fullname , Len(Fullname) - len(replace(fullname , n , '')) from employeedetail

In [ ]:
9. Write an SQL query to update the employee names by removing leading and trailing spaces.
UPDATE employeedetail
SET Fullname =LTRIM(RTRIM(Fullname))

In [ ]:
10. Fetch all the employees who are not working on any project.
Select empid from employeesalary
where project is null

In [ ]:
11. Write an SQL query to fetch employee names having a salary greater than or equal to 5000 and less than or equal to 10000.
select employyeename from employedetail 
where employid in ( select empid from empsalary
                      where salary >= 5000 and salary <= 10000)

In [ ]:
12. Current date
select Now()
select currdate()
# for tym
select current_time()

In [ ]:
13. Write an SQL query to fetch all the Employee details from the EmployeeDetails table who joined in the Year 2020.
select * from employeedetail
where year(dateofjoining ) == '2020'

In [ ]:
14. Write an SQL query to fetch all employee records from the EmployeeDetails table who have a salary record in the EmployeeSalary table.
select * from empdetail
where empid = (select empid from empsalary
               where salary is not null );


SELECT * FROM EmployeeDetails E
WHERE EXISTS
(SELECT * FROM EmployeeSalary S 
WHERE  E.EmpId = S.EmpId);

In [ ]:
15. Write an SQL query to fetch the project-wise count of employees sorted by project’s count in descending order.

select project , count(empid) as empprojectcount from empsalary
group by project  
oredr by empprojectcount desc

In [ ]:
16. Write a query to fetch employee names and salary records. Display the employee details even if the salary record is not present for the employee.

select d.empname , s.salary from emplydetail d left join salary s
on d.empid = s.empid

In [ ]:
########################################################################## HARD ONES #########################################################################

In [ ]:
17. Write an SQL query to join 3 tables.

select * from table 1 a join (select * from table 2 b cross join table 3 c
                            on b.col1 = c.col3) d
on a.col1 = d.col1

SELECT column1, column2
FROM TableA
JOIN TableB ON TableA.Column3 = TableB.Column3
JOIN TableC ON TableA.Column4 = TableC.Column4;

In [ ]:
18. Write an SQL query to fetch all the Employees who are also managers from the EmployeeDetails table.



select e.fullname from empdetail e innerjoin empdetail d
on e.empid = d.mangerid


select e.fullname from empdetail e join empdetail d
on e.empid = d.empid
where e.empid = d.managerid

In [ ]:
19. Write an SQL query to fetch duplicate records from EmployeeDetails (without considering the primary key – EmpId).

#SELECT value FROM table GROUP BY value HAVING COUNT(*)>1;

select fullname , managerid , salary , count(*) from empdetail
group by fullname , managerid , salary 
having count(*) > 1;

In [ ]:
20 .Write an SQL query to remove duplicates from a table without using a temporary table.

Here, we can use delete with alias and inner join. We will check for the equality of all the matching records and then remove the row with a higher EmpId.

DELETE E1 FROM EmployeeDetails E1
INNER JOIN EmployeeDetails E2 
WHERE E1.EmpId > E2.EmpId 
AND E1.FullName = E2.FullName 
AND E1.ManagerId = E2.ManagerId
AND E1.DateOfJoining = E2.DateOfJoining
AND E1.City = E2.City;

In [ ]:
21. Write an SQL query to fetch only odd rows from the table.

select * from employeedetail
where mod( empid , 2) <> 0

# if we need even rows
select * from employeedetail
where mod( empid , 2) = 0

In [ ]:
22. Write an SQL query to create a new table with data and structure copied from another table.

create table tablename
As select * from employeedetail

In [ ]:
23.Write an SQL query to create an empty table with the same structure as some other table.

create table tablename like employeedetail

In [ ]:
24. Write an SQL query to fetch top n records.
select * from employeedetail
order by empid limit 4

In [ ]:
25. Write an SQL query to find the 10th(nth) highest salary from a table.

SELECT Salary FROM Employee
ORDER BY Salary DESC LIMIT N-1,1;

Here we are ordering our salaries in descending order so we will get the highest salary first and then subsequently lower salaries. 
The limit clause has two components, the First component is to 'skip a number of rows from the top' and 'the second component is to display
the number of rows we want. 
Let us see with an example :

To find the 4th Highest salary query will be

Query:

Select emp_sal from Emp order by emp_sal DESC limit 3,1;
# limit 3,1 so it means it will from the row 3 after the third row only 1 row will bw shown

In [ ]:
Write SQL query to find the 3rd highest salary from a table without using the TOP/limit keyword.

select salary from empsalry emp1
where 2 = 
SELECT Salary
FROM EmployeeSalary Emp1
WHERE N-1 = (
                SELECT COUNT( DISTINCT ( Emp2.Salary ) )
                FROM EmployeeSalary Emp2
                WHERE Emp2.Salary > Emp1.Salary
            )

In [ ]:
#EmployeeInfo Table:

EmpID   EmpFname  EmpLname  Department  Project  Address DOB  Gender

#EmployeePosition Table:

EmpID  EmpPosition  DateOfJoining  Salary

In [ ]:
1.  Write a query to fetch the EmpFname from the EmployeeInfo table in upper case and use the ALIAS name as EmpName.
select upper(EmpFname) as Empname from EmployeeInfo

In [ ]:
2. Write a query to fetch the number of employees working in the department ‘HR’

select count(Empid) from employeeinfo
where department = 'Hr'

In [ ]:
3. Write a query to get the current date.
  select curdate()

In [ ]:
4. Write a query to retrieve the first four characters of  EmpLname from the EmployeeInfo table.
select substring(emplname , 1 , 4)  from employeedetail

In [ ]:
5.Write a query to fetch only the place name(string before brackets) from the Address column of EmployeeInfo table.